pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/USBD/Mass_Storage_IAP/Src_IAP/iap_usb_bulk_only_transport.c
/*********************************************************************************************************//**
 * @file    USBD/Mass_Storage_IAP/Src_IAP/iap_usb_bulk_only_transport.c
 * @version $Rev:: 553          $
 * @date    $Date:: 2017-07-18 #$
 * @brief   The Bulk Only Transport (BOT).
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "ht32_usbd_core.h"
#include "iap_usb_bulk_only_transport.h"
#include "iap_usb_scsi_block_command.h"
#include "iap_flash_disk.h"
#include "iap_handler.h"

/** @addtogroup HT32_Series_Peripheral_Examples HT32 Peripheral Examples
  * @{
  */

/** @addtogroup USBD_Examples USBD
  * @{
  */

/** @addtogroup USBD_Mass_Storage_IAP USBD Mass Storage IAP
  * @{
  */

/** @addtogroup Mass_Storage_IAP IAP
  * @{
  */


/* Private types -------------------------------------------------------------------------------------------*/
typedef __PACKED_H struct _BM_FLAG_TYPEBIT
{
  u8 Reserved  :6,
     Obsolete  :1,
     Direction :1;
} __PACKED_F BOT_CBW_bmFlag_TypeBit;

typedef __PACKED_H struct
{
  u32 dCBWSignature;
  u32 dCBWTag;
  u32 dCBWDataTransferLength;
  BOT_CBW_bmFlag_TypeBit bmCBWFlags;
  u8  bCBWLUN;
  u8  bCBWCBLength;
  u8  CBWCB[16];
  u8  Reserved[33];
} __PACKED_F BOT_CBW_TypeDef;

typedef __PACKED_H struct
{
  u32 dCSWSignature;
  u32 dCSWTag;
  u32 dCSWDataResidue;
  u8  bCSWStatus;
} __PACKED_F BOT_CSW_TypeDef;

/* Private constants ---------------------------------------------------------------------------------------*/
#define _BOT_CBW_SIGNATURE          (0x43425355)
#define _BOT_CSW_SIGNATURE          (0x53425355)
#define _BOT_CBW_PACKET_LENGTH      (31)
#define _BOT_CSW_PACKET_LENGTH      (13)

#define _BOT_MAX_CB_LENGTH          (16)

#if (BOT_LUN_NUM > 15)
#error "The LUN must be 0 through 15."
#endif

/* Private function prototypes -----------------------------------------------------------------------------*/
static void _BOT_CBWProcess(void);
static void _BOT_StallEPT(BOT_STALL_Enum Dir);

/* Private macro -------------------------------------------------------------------------------------------*/
#define IS_WAIT_RESET_RECOVERY      (gUSBCore.Info.uIsDiscardClearFeature)
#define GET_MEDIA(lun)              (&gMediaInfo[lun])

/* Global variables ----------------------------------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------------------------------------*/
static u32 guMaxLUN = (BOT_LUN_NUM - 1);
static BOT_State_Enum gBOTState;
__ALIGN4 static BOT_CBW_TypeDef gCBW;
__ALIGN4 static BOT_CSW_TypeDef gCSW;

static BOT_Media_TypeDef gMediaInfo[BOT_LUN_NUM] =
{
  {
    FLASH_DISK0_ID,
    {FLASH_DISK0_BlockCount, FLASH_DISK0_BlockSize, FLASH_DISK0_MemorySize, IAP_FLASH_START, IAP_FLASH_SIZE},
    (pInit)FLASH_DISK_Init,
    (pReadFun)FLASH_DISK_Read,
    (pWriteFun)FLASH_DISK_Write,
    (pGetStatusFun)FLASH_DISK_GetStatus,
    NULL,
    NULL,
  },
};

/* Global Function -----------------------------------------------------------------------------------------*/

/*********************************************************************************************************//**
  * @brief  BOT Initialization.
  * @retval None
  ***********************************************************************************************************/
void BOT_Init(void)
{
  gCSW.dCSWSignature = _BOT_CSW_SIGNATURE;
  SBC_Init(GET_MEDIA(0), 0);
  gMediaInfo[0].Init(gMediaInfo[0].uId, &(gMediaInfo[0].Size));

  BOT_Reset();

  return;
}

/*********************************************************************************************************//**
  * @brief  BOT Reset function.
  * @retval None
  ***********************************************************************************************************/
void BOT_Reset(void)
{
  extern USBDCore_TypeDef gUSBCore;

  gBOTState = BOT_STATE_IDLE;
  IS_WAIT_RESET_RECOVERY = FALSE;

  return;
}

/*********************************************************************************************************//**
  * @brief  Get Maximum Logical Unit Number (LUN).
  * @retval guMaxLUN: Address of Maximum LUN
  ***********************************************************************************************************/
uc8 *BOT_GetMaxLUNAddress(void)
{
  return ((uc8 *)&guMaxLUN);
}

/*********************************************************************************************************//**
  * @brief  BOT OUT Process.
  * @retval None
  ***********************************************************************************************************/
void BOT_OUTProcess(void)
{
  BOT_Media_TypeDef *pMedia = GET_MEDIA(gCBW.bCBWLUN);

  switch (gBOTState)
  {
    /*------------------------------------------------------------------------------------------------------*/
    /* Decode and process CBW                                                                               */
    /*------------------------------------------------------------------------------------------------------*/
    case BOT_STATE_IDLE:
    {
      _BOT_CBWProcess();
      break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* Data OUT process                                                                                     */
    /*------------------------------------------------------------------------------------------------------*/
    case BOT_STATE_DATAOUT:
    {

      SBC_DataOUT(pMedia, gCBW.CBWCB);
      break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* BOT State machine out of sync, report Phase Error by CSW                                             */
    /*------------------------------------------------------------------------------------------------------*/
    #if 0
    default:
    {
      SBC_UpdateSenseData(pMedia, SK_ILLEGAL_REQUEST, ASC_INVALID_FIELED_IN_COMMAND);
      BOT_ErrorHandler(BOT_STALL_BOTH, BOT_CSW_STATUS_PHASEERR);
      break;
    }
    #endif
  }

  return;
}

