pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/USBD/Mass_Storage_IAP/Src_IAP/iap_usb_bulk_only_transport.c
/*********************************************************************************************************//**
  * @brief  BOT IN process.
  * @retval None
  ***********************************************************************************************************/
void BOT_INProcess(void)
{
  BOT_Media_TypeDef *pMedia = GET_MEDIA(gCBW.bCBWLUN);

  switch (gBOTState)
  {
    /*------------------------------------------------------------------------------------------------------*/
    /* Data IN process                                                                                      */
    /*------------------------------------------------------------------------------------------------------*/
    case BOT_STATE_DATAIN:
    {
      SBC_DataIN(pMedia, gCBW.CBWCB);
      break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* Last Data IN, send CSW                                                                               */
    /*------------------------------------------------------------------------------------------------------*/
    case BOT_STATE_DATAIN_LAST:
    {
      /* STALL IN Endpoint when last Data IN but Data Residue in CSW is not zero                            */
      if (gCSW.dCSWDataResidue != 0)
      {
        _BOT_StallEPT(BOT_STALL_IN);
      }
      BOT_SendCSW(BOT_CSW_STATUS_PASSED);
      break;
    }
    /*------------------------------------------------------------------------------------------------------*/
    /* CSW is sent                                                                                          */
    /*------------------------------------------------------------------------------------------------------*/
    case BOT_STATE_SENDCSW:
    //case BOT_STATE_ERROR:
    {
      gBOTState = BOT_STATE_IDLE;
      /*----------------------------------------------------------------------------------------------------*/
      /* Read OUT data with zero length to inform USB Device peripheral that process of CBW OUT             */
      /* data is finished. The USB Device will send ACK to Host when received next CBW OUT data             */
      /*----------------------------------------------------------------------------------------------------*/
      USBDCore_EPTReadOUTData(BOT_OUT_EPT, (u32 *)NULL, USB_DISCARD_OUT_DATA);
      break;
    }
    default:
    {
      break;
    }
  }

  return;
}

/*********************************************************************************************************//**
  * @brief  Check CBW Parameter is valid or not (Cass1 ~ Cass 13).
  * @param  DeviceDirection: Device expects data transfer direction.
  *         @arg BOT_DIR_OUT: Device expects OUT transfer (Host to Device)
  *         @arg BOT_DIR_IN: Device expects IN transfer (Device to Host)
  *         @arg BOT_DIR_NONE: Device expects No transfer
  * @param  uDeviceLength: Device expects data length.
  * @retval Result: TRUE for parameter is valid, FALSE for parameter is invalid.
  ***********************************************************************************************************/
u32 BOT_CheckCBWParameter(BOT_Dir_Enum DeviceDirection, u32 uDeviceLength)
{
  BOT_CSW_STATUS_Enum status = BOT_CSW_STATUS_PASSED;
  BOT_STALL_Enum direction;
  u32 Result;

  __DBG_USBPrintf("%06ld %dH%d %dD%d\r\n", __DBG_USBCount,
                                           gCBW.bmCBWFlags.Direction,
                                           gCBW.dCBWDataTransferLength,
                                           DeviceDirection,
                                           uDeviceLength
                                           );

  /*--------------------------------------------------------------------------------------------------------*/
  /* Case 1 ~ 3                                                                                             */
  /*--------------------------------------------------------------------------------------------------------*/
  if (gCBW.dCBWDataTransferLength == 0)
  {
    if (DeviceDirection == BOT_DIR_NONE)
    {
      /*----------------------------------------------------------------------------------------------------*/
      /* Case 1 (Hn = Dn)                                                                                   */
      /*----------------------------------------------------------------------------------------------------*/
      __DBG_USBPrintf("%06ld CASE1\r\n", __DBG_USBCount);
      gCSW.dCSWDataResidue = 0;
    }
    else
    {
      /*----------------------------------------------------------------------------------------------------*/
      /* Case 2 (Hn < Di) / Case 3 (Hn < Do)                                                                */
      /*----------------------------------------------------------------------------------------------------*/
      direction = BOT_STALL_NONE;
      status = BOT_CSW_STATUS_PHASEERR;
      __DBG_USBPrintf("%06ld CASE2, 3\r\n", __DBG_USBCount);
    }
  }
  /*--------------------------------------------------------------------------------------------------------*/
  /* Case 6 (Hi = Di) / Case 12 (Ho = Do)                                                                   */
  /*--------------------------------------------------------------------------------------------------------*/
  else if (gCBW.dCBWDataTransferLength == uDeviceLength && gCBW.bmCBWFlags.Direction == DeviceDirection)
  {
    gBOTState = (DeviceDirection == BOT_DIR_IN) ? BOT_STATE_DATAIN : BOT_STATE_DATAOUT;
    __DBG_USBPrintf("%06ld CASE6, 12\r\n", __DBG_USBCount);
  }
  /*--------------------------------------------------------------------------------------------------------*/
  /* Case 4, 5, 7, 8                                                                                        */
  /*--------------------------------------------------------------------------------------------------------*/
  else if (gCBW.bmCBWFlags.Direction == BOT_DIR_IN)
  {
    switch (DeviceDirection)
    {
      case BOT_DIR_NONE:
      case BOT_DIR_IN:
      {
        if (gCBW.dCBWDataTransferLength > uDeviceLength)
        {
          /*------------------------------------------------------------------------------------------------*/
          /* Case 4 (Hi > Dn) / Case 5 (Hi > Di)                                                            */
          /*------------------------------------------------------------------------------------------------*/
          direction = BOT_STALL_IN;
          status = BOT_CSW_STATUS_FAILED;
          gCSW.dCSWDataResidue = gCBW.dCBWDataTransferLength - uDeviceLength;
          __DBG_USBPrintf("%06ld CASE4, 5\r\n", __DBG_USBCount);
        }
        else if (gCBW.dCBWDataTransferLength < uDeviceLength)
        {
          /*------------------------------------------------------------------------------------------------*/
          /* Case 7 (Hi < Di)                                                                               */
          /*------------------------------------------------------------------------------------------------*/
          direction = BOT_STALL_IN;
          status = BOT_CSW_STATUS_PHASEERR;
          __DBG_USBPrintf("%06ld CASE7\r\n", __DBG_USBCount);
        }
        break;
      }
      case BOT_DIR_OUT:
      {
        /*--------------------------------------------------------------------------------------------------*/
        /* Case 8 (Hi <> Do)                                                                                */
        /*--------------------------------------------------------------------------------------------------*/
        direction = BOT_STALL_IN;
        status = BOT_CSW_STATUS_PHASEERR;
        __DBG_USBPrintf("%06ld CASE8\r\n", __DBG_USBCount);
        break;
      }
    }
  }
  /*--------------------------------------------------------------------------------------------------------*/
  /* Case 9, 10, 11, 13                                                                                     */
  /*--------------------------------------------------------------------------------------------------------*/
  else if (gCBW.bmCBWFlags.Direction == BOT_DIR_OUT)
  {
    switch (DeviceDirection)
    {
      case BOT_DIR_NONE:
      case BOT_DIR_OUT:
      {
        if (gCBW.dCBWDataTransferLength > uDeviceLength)
        {
          /*------------------------------------------------------------------------------------------------*/
          /* Case 9 (Ho > Dn) / Case 11 (Ho > Do)                                                           */
          /*------------------------------------------------------------------------------------------------*/
          direction = BOT_STALL_OUT;
          status = BOT_CSW_STATUS_FAILED;
          gCSW.dCSWDataResidue = gCBW.dCBWDataTransferLength - uDeviceLength;
          __DBG_USBPrintf("%06ld CASE9, 11\r\n", __DBG_USBCount);
        }
        else if (gCBW.dCBWDataTransferLength < uDeviceLength)
        {
          /*------------------------------------------------------------------------------------------------*/
          /* Case 13 (Ho < Do)                                                                              */
          /*------------------------------------------------------------------------------------------------*/
          direction = BOT_STALL_OUT;
          status = BOT_CSW_STATUS_PHASEERR;
          __DBG_USBPrintf("%06ld CASE13\r\n", __DBG_USBCount);
        }
        break;
      }
      case BOT_DIR_IN:
      {
        /*--------------------------------------------------------------------------------------------------*/
        /* Case 10 (Ho <> Di)                                                                               */
        /*--------------------------------------------------------------------------------------------------*/
        direction = BOT_STALL_OUT;
        status = BOT_CSW_STATUS_PHASEERR;
        __DBG_USBPrintf("%06ld CASE10\r\n", __DBG_USBCount);
        break;
      }
    }
  }

  if (status != BOT_CSW_STATUS_PASSED)
  {
    SBC_UpdateSenseData(GET_MEDIA(gCBW.bCBWLUN), SK_ILLEGAL_REQUEST, ASC_INVALID_FIELED_IN_COMMAND);
    BOT_ErrorHandler(direction, status);
    Result = FALSE;
  }
  else
  {
    Result = TRUE;
  }

  return Result;
}

