pok3r-custom/pok3r_re_firmware/vendor/holtek/HT32_STD_1xxxx_FWLib_v003_1679/example/USBD/Mass_Storage_IAP/Src_IAP/iap_usb_bulk_only_transport.c
/*********************************************************************************************************//**
  * @brief  Write BOT IN data and update BOT State/CSW.
  * @param  pBuffer: Source buffer
  * @param  uLen: Length for write IN data
  * @param  status: BOT State after Write IN operation
  *         @arg BOT_STATE_DATAIN: The Data IN operation, BOT state machine will call to SBC read command
  *                                after IN Data transmission is finished.
  *         @arg BOT_STATE_DATAIN_LAST: The last Data IN operation, BOT state machine will send CSW after
  *                                     IN Data transmission is finished.
  * @retval None
  ***********************************************************************************************************/
void BOT_WriteINData(u8 *pBuffer, u32 uLen, BOT_State_Enum status)
{
  __DBG_USBPrintf("%06ld BulkIN\t[%02d]\r\n", __DBG_USBCount, uLen);
  __DBG_USBDump((uc8 *)pBuffer, uLen);

  USBDCore_EPTWriteINData(BOT_IN_EPT, (u32 *)pBuffer, uLen);

  gBOTState = status;
  gCSW.dCSWDataResidue -= uLen;

  return;
}

/*********************************************************************************************************//**
  * @brief  Read BOT OUT data and update CSW.
  * @param  pBuffer: Destination buffer
  * @param  uLen: Length for read OUT data
  * @retval None
  ***********************************************************************************************************/
void BOT_ReadOUTData(u8 *pBuffer, u32 uLen)
{
  gBOTState = BOT_STATE_DATAOUT;

  (uLen == USB_DISCARD_OUT_DATA) ? USBDCore_EPTReadOUTData(BOT_OUT_EPT, (u32 *)pBuffer, uLen) : USBDCore_EPTReadMemory(BOT_OUT_EPT, (u32 *)pBuffer, uLen);

  gCSW.dCSWDataResidue -= uLen;

  __DBG_USBPrintf("%06ld BulkOUT\t[%02d]\r\n", __DBG_USBCount, uLen);
  __DBG_USBDump((uc8 *)pBuffer, uLen);

  return;
}

/*********************************************************************************************************//**
  * @brief  Send CSW.
  * @param  status: bCSWStatus field which define by BOT_CSW_STATUS_Enum
  *         @arg BOT_CSW_STATUS_PASSED: Command passed (Good status)
  *         @arg BOT_CSW_STATUS_FAILED: Command failed
  *         @arg BOT_CSW_STATUS_PHASEERR: Phase error
  * @retval None
  ***********************************************************************************************************/
void BOT_SendCSW(BOT_CSW_STATUS_Enum status)
{
  gCSW.bCSWStatus = status;

  __DBG_USBPrintf("%06ld CSW \t[%x][%d][%d]\r\n", ++__DBG_USBCount, gCSW.dCSWTag, gCSW.dCSWDataResidue, gCSW.bCSWStatus);
  __DBG_USBDump((uc8 *)&gCSW, _BOT_CSW_PACKET_LENGTH);

  /* Wait until last STALL transmission is finished                                                         */
  USBDCore_EPTWaitSTALLSent(BOT_IN_EPT);

  gBOTState = BOT_STATE_SENDCSW;

  USBDCore_EPTWriteINData(BOT_IN_EPT, (u32 *)&gCSW, _BOT_CSW_PACKET_LENGTH);

  return;
}

/*********************************************************************************************************//**
  * @brief  BOT Error handler.
  * @param  StallEPT: Endpoint direction which want to STALL.
  *         @arg BOT_STALL_OUT: OUT Endpoint
  *         @arg BOT_STALL_IN: IN Endpoint
  *         @arg BOT_STALL_BOTH: Both IN and OUT endpoint
  *         @arg BOT_STALL_BYDIR: Depend on CBW direction field (gCBW.bmCBWFlags.Direction)
  * @param  CSWstatus: bCSWStatus field which define by BOT_CSW_STATUS_Enum
  *         @arg BOT_CSW_STATUS_PASSED: Command passed (Good status)
  *         @arg BOT_CSW_STATUS_FAILED: Command failed
  *         @arg BOT_CSW_STATUS_PHASEERR: Phase error
  * @retval None
  ***********************************************************************************************************/
void BOT_ErrorHandler(BOT_STALL_Enum StallEPT, BOT_CSW_STATUS_Enum CSWstatus)
{
  if (StallEPT == BOT_STALL_BYDIR)
  {
    StallEPT = (gCBW.bmCBWFlags.Direction == BOT_DIR_OUT) ? BOT_STALL_OUT : BOT_STALL_IN;
  }
  _BOT_StallEPT(StallEPT);
  BOT_SendCSW(CSWstatus);

  return;
}

/* Private functions ---------------------------------------------------------------------------------------*/

/*********************************************************************************************************//**
  * @brief  Decode and process CBW command.
  * @retval None
  ***********************************************************************************************************/
static void _BOT_CBWProcess(void)
{
  extern USBDCore_TypeDef gUSBCore;
  BOT_Media_TypeDef *pMedia;

  u32 uCBWLen;

  /*--------------------------------------------------------------------------------------------------------*/
  /* Read CBW OUT data from USB Buffer.                                                                     */
  /*--------------------------------------------------------------------------------------------------------*/
  uCBWLen = USBDCore_EPTReadMemory(BOT_OUT_EPT, (u32 *)&gCBW, BOT_MAX_PACKET_SIZE);

  __DBG_USBPrintf("%06ld CBW \t[%x][%d][%d][%d][%d]\r\n", ++__DBG_USBCount, gCBW.dCBWTag, gCBW.dCBWDataTransferLength, gCBW.bmCBWFlags.Direction, gCBW.bCBWLUN, gCBW.bCBWCBLength);
  __DBG_USBDump((uc8 *)&gCBW, uCBWLen);

  gCSW.dCSWTag = gCBW.dCBWTag;

  pMedia = (gCBW.bCBWLUN < BOT_LUN_NUM) ? GET_MEDIA(gCBW.bCBWLUN) : NULL;

  /*--------------------------------------------------------------------------------------------------------*/
  /* Check CBW is valid or not                                                                              */
  /*--------------------------------------------------------------------------------------------------------*/
  if (gCBW.dCBWSignature != _BOT_CBW_SIGNATURE || uCBWLen != _BOT_CBW_PACKET_LENGTH)
  {
    _BOT_StallEPT(BOT_STALL_BOTH);
    IS_WAIT_RESET_RECOVERY = TRUE;
    gBOTState = BOT_STATE_ERROR;
    return;
  }

  gCSW.dCSWDataResidue = gCBW.dCBWDataTransferLength;

  /*--------------------------------------------------------------------------------------------------------*/
  /* Check CBW is meaningful or not                                                                         */
  /*--------------------------------------------------------------------------------------------------------*/
  if ((gCBW.bCBWLUN >= BOT_LUN_NUM) || (gCBW.bCBWCBLength < 1) || (gCBW.bCBWCBLength > _BOT_MAX_CB_LENGTH))
  {
    _BOT_StallEPT(BOT_STALL_BOTH);
    IS_WAIT_RESET_RECOVERY = TRUE;
    gBOTState = BOT_STATE_ERROR;
    return;
  }

  API_USB_EPTn_CLR_HALT(BOT_OUT_EPT);
  API_USB_EPTn_CLR_HALT(BOT_IN_EPT);
  SBC_CMDHandler(pMedia, (u8 *)gCBW.CBWCB);

  return;
}

/*********************************************************************************************************//**
  * @brief  STALL specify endpoint.
  * @param  direction: Endpoint direction which want to STALL.
  *         @arg BOT_STALL_OUT: OUT Endpoint
  *         @arg BOT_STALL_IN: IN Endpoint
  *         @arg BOT_STALL_BOTH: Both IN and OUT endpoint
  *         @arg BOT_STALL_NONE: None
  * @retval None
  ***********************************************************************************************************/
static void _BOT_StallEPT(BOT_STALL_Enum direction)
{
  switch (direction)
  {
    case BOT_STALL_IN:
    {
      USBDCore_EPTSetSTALL(BOT_IN_EPT);
      break;
    }
    case BOT_STALL_OUT:
    {
      USBDCore_EPTSetSTALL(BOT_OUT_EPT);
      break;
    }
    case BOT_STALL_BOTH:
    {
      USBDCore_EPTSetSTALL(BOT_IN_EPT);
      USBDCore_EPTSetSTALL(BOT_OUT_EPT);
      break;
    }
    default:
    {
      break;
    }
  }

  return;
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
